run/alfa200/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    (-8.000000  0.000000  0.085505)
    (0.000000  0.000000  8.000000)
    (0.750000  0.000000  8.000000)
    (16.000000  0.000000  8.000000)
    (-0.234923  0.000000  0.085505)
    (0.031157  0.000000  0.052584)
    (-0.008340  0.000000  -0.022323)
    (0.704769  0.000000  -0.256515)
    (16.000000  0.000000  -0.256515)
    (0.000000  0.000000  -8.000000)
    (0.750000  0.000000  -8.000000)
    (16.000000  0.000000  -8.000000)
    (-8.000000  0.100000  0.085505)
    (0.000000  0.100000  8.000000)
    (0.750000  0.100000  8.000000)
    (16.000000  0.100000  8.000000)
    (-0.234923  0.100000  0.085505)
    (0.031157  0.100000  0.052584)
    (-0.008340  0.100000  -0.022323)
    (0.704769  0.100000  -0.256515)
    (16.000000  0.100000  -0.256515)
    (0.000000  0.100000  -8.000000)
    (0.750000  0.100000  -8.000000)
    (16.000000  0.100000  -8.000000)
);

blocks
(
    hex (16 17 13 12 4 5 1 0)     (40 100 1) edgeGrading (4 100 1)
    hex (17 19 14 13 5 7 2 1)     (40 100 1) simpleGrading (1 100 1)
    hex (19 20 15 14 7 8 3 2)     (50 100 1) simpleGrading (100 100 1)
    hex (4 6 9 0 16 18 21 12)     (40 100 1) edgeGrading (4 100 1)
    hex (6 7 10 9 18 19 22 21)    (40 100 1) simpleGrading (1 100 1)
    hex (7 8 11 10 19 20 23 22)   (50 100 1) simpleGrading (100 100 1)
);

edges
(
    spline 4 5
    (
       (-0.234923  0.000000  0.085505)
       (-0.234784  0.000000  0.085845)
       (-0.234671  0.000000  0.086074)
       (-0.234545  0.000000  0.086305)
       (-0.234404  0.000000  0.086536)
       (-0.234207  0.000000  0.086827)
       (-0.233988  0.000000  0.087118)
       (-0.233683  0.000000  0.087482)
       (-0.233344  0.000000  0.087847)
       (-0.232971  0.000000  0.088213)
       (-0.232457  0.000000  0.088669)
       (-0.231892  0.000000  0.089123)
       (-0.231276  0.000000  0.089574)
       (-0.230608  0.000000  0.090022)
       (-0.229465  0.000000  0.090712)
       (-0.228200  0.000000  0.091389)
       (-0.226453  0.000000  0.092210)
       (-0.224523  0.000000  0.092999)
       (-0.221858  0.000000  0.093933)
       (-0.218916  0.000000  0.094799)
       (-0.214860  0.000000  0.095775)
       (-0.210390  0.000000  0.096620)
       (-0.204235  0.000000  0.097471)
       (-0.197465  0.000000  0.098076)
       (-0.190098  0.000000  0.098418)
       (-0.177436  0.000000  0.098396)
       (-0.163436  0.000000  0.097668)
       (-0.148176  0.000000  0.096215)
       (-0.131741  0.000000  0.094031)
       (-0.114219  0.000000  0.091124)
       (-0.095702  0.000000  0.087511)
       (-0.076285  0.000000  0.083212)
       (-0.056061  0.000000  0.078259)
       (-0.035119  0.000000  0.072684)
       (-0.013548  0.000000  0.066522)
       (0.008569  0.000000  0.059809)
       (0.031157  0.000000  0.052584)
    )
    spline 5 7
    (
       (0.031157  0.000000  0.052584)
       (0.054146  0.000000  0.044885)
       (0.077475  0.000000  0.036747)
       (0.101087  0.000000  0.028206)
       (0.124937  0.000000  0.019293)
       (0.148984  0.000000  0.010041)
       (0.173191  0.000000  0.000474)
       (0.197528  0.000000  -0.009384)
       (0.221969  0.000000  -0.019515)
       (0.246492  0.000000  -0.029900)
       (0.271078  0.000000  -0.040532)
       (0.295712  0.000000  -0.051403)
       (0.320378  0.000000  -0.062514)
       (0.345069  0.000000  -0.073866)
       (0.369781  0.000000  -0.085471)
       (0.394516  0.000000  -0.097339)
       (0.419292  0.000000  -0.109488)
       (0.444136  0.000000  -0.121939)
       (0.469099  0.000000  -0.134716)
       (0.494255  0.000000  -0.147840)
       (0.519714  0.000000  -0.161337)
       (0.545626  0.000000  -0.175223)
       (0.572195  0.000000  -0.189512)
       (0.599684  0.000000  -0.204205)
       (0.627745  0.000000  -0.218930)
       (0.651325  0.000000  -0.230954)
       (0.671089  0.000000  -0.240710)
       (0.687581  0.000000  -0.248588)
       (0.704769  0.000000  -0.256515)
    )
    spline 4 6
    (
       (-0.234923  0.000000  0.085505)
       (-0.234958  0.000000  0.085401)
       (-0.234989  0.000000  0.085295)
       (-0.235014  0.000000  0.085187)
       (-0.235035  0.000000  0.085077)
       (-0.235052  0.000000  0.084964)
       (-0.235066  0.000000  0.084821)
       (-0.235073  0.000000  0.084674)
       (-0.235074  0.000000  0.084524)
       (-0.235066  0.000000  0.084372)
       (-0.235047  0.000000  0.084175)
       (-0.235018  0.000000  0.083974)
       (-0.234977  0.000000  0.083769)
       (-0.234911  0.000000  0.083505)
       (-0.234829  0.000000  0.083234)
       (-0.234729  0.000000  0.082956)
       (-0.234582  0.000000  0.082598)
       (-0.234407  0.000000  0.082229)
       (-0.234154  0.000000  0.081754)
       (-0.233859  0.000000  0.081261)
       (-0.233524  0.000000  0.080752)
       (-0.232921  0.000000  0.079926)
       (-0.232220  0.000000  0.079062)
       (-0.231205  0.000000  0.077929)
       (-0.230037  0.000000  0.076742)
       (-0.227902  0.000000  0.074778)
       (-0.225385  0.000000  0.072685)
       (-0.222482  0.000000  0.070468)
       (-0.215673  0.000000  0.065787)
       (-0.207314  0.000000  0.060656)
       (-0.197355  0.000000  0.055083)
       (-0.185754  0.000000  0.049076)
       (-0.172479  0.000000  0.042644)
       (-0.157516  0.000000  0.035794)
       (-0.140870  0.000000  0.028541)
       (-0.122565  0.000000  0.020899)
       (-0.102645  0.000000  0.012888)
       (-0.081173  0.000000  0.004532)
       (-0.058231  0.000000  -0.004142)
       (-0.033917  0.000000  -0.013104)
       (-0.008340  0.000000  -0.022323)
    )
    spline 6 7
    (
       (-0.008340  0.000000  -0.022323)
       (0.018379  0.000000  -0.031763)
       (0.046112  0.000000  -0.041394)
       (0.074730  0.000000  -0.051180)
       (0.104103  0.000000  -0.061091)
       (0.134105  0.000000  -0.071095)
       (0.164618  0.000000  -0.081169)
       (0.195536  0.000000  -0.091290)
       (0.226768  0.000000  -0.101441)
       (0.258236  0.000000  -0.111609)
       (0.289885  0.000000  -0.121791)
       (0.321681  0.000000  -0.131984)
       (0.353606  0.000000  -0.142198)
       (0.385673  0.000000  -0.152445)
       (0.417908  0.000000  -0.162747)
       (0.450364  0.000000  -0.173129)
       (0.483105  0.000000  -0.183627)
       (0.516218  0.000000  -0.194278)
       (0.549793  0.000000  -0.205132)
       (0.583930  0.000000  -0.216239)
       (0.617902  0.000000  -0.227386)
       (0.645587  0.000000  -0.236558)
       (0.668087  0.000000  -0.244082)
       (0.686321  0.000000  -0.250235)
       (0.704769  0.000000  -0.256515)
    )
    spline 16 17
    (
       (-0.234923  0.100000  0.085505)
       (-0.234784  0.100000  0.085845)
       (-0.234671  0.100000  0.086074)
       (-0.234545  0.100000  0.086305)
       (-0.234404  0.100000  0.086536)
       (-0.234207  0.100000  0.086827)
       (-0.233988  0.100000  0.087118)
       (-0.233683  0.100000  0.087482)
       (-0.233344  0.100000  0.087847)
       (-0.232971  0.100000  0.088213)
       (-0.232457  0.100000  0.088669)
       (-0.231892  0.100000  0.089123)
       (-0.231276  0.100000  0.089574)
       (-0.230608  0.100000  0.090022)
       (-0.229465  0.100000  0.090712)
       (-0.228200  0.100000  0.091389)
       (-0.226453  0.100000  0.092210)
       (-0.224523  0.100000  0.092999)
       (-0.221858  0.100000  0.093933)
       (-0.218916  0.100000  0.094799)
       (-0.214860  0.100000  0.095775)
       (-0.210390  0.100000  0.096620)
       (-0.204235  0.100000  0.097471)
       (-0.197465  0.100000  0.098076)
       (-0.190098  0.100000  0.098418)
       (-0.177436  0.100000  0.098396)
       (-0.163436  0.100000  0.097668)
       (-0.148176  0.100000  0.096215)
       (-0.131741  0.100000  0.094031)
       (-0.114219  0.100000  0.091124)
       (-0.095702  0.100000  0.087511)
       (-0.076285  0.100000  0.083212)
       (-0.056061  0.100000  0.078259)
       (-0.035119  0.100000  0.072684)
       (-0.013548  0.100000  0.066522)
       (0.008569  0.100000  0.059809)
       (0.031157  0.100000  0.052584)
    )
    spline 17 19
    (
       (0.031157  0.100000  0.052584)
       (0.054146  0.100000  0.044885)
       (0.077475  0.100000  0.036747)
       (0.101087  0.100000  0.028206)
       (0.124937  0.100000  0.019293)
       (0.148984  0.100000  0.010041)
       (0.173191  0.100000  0.000474)
       (0.197528  0.100000  -0.009384)
       (0.221969  0.100000  -0.019515)
       (0.246492  0.100000  -0.029900)
       (0.271078  0.100000  -0.040532)
       (0.295712  0.100000  -0.051403)
       (0.320378  0.100000  -0.062514)
       (0.345069  0.100000  -0.073866)
       (0.369781  0.100000  -0.085471)
       (0.394516  0.100000  -0.097339)
       (0.419292  0.100000  -0.109488)
       (0.444136  0.100000  -0.121939)
       (0.469099  0.100000  -0.134716)
       (0.494255  0.100000  -0.147840)
       (0.519714  0.100000  -0.161337)
       (0.545626  0.100000  -0.175223)
       (0.572195  0.100000  -0.189512)
       (0.599684  0.100000  -0.204205)
       (0.627745  0.100000  -0.218930)
       (0.651325  0.100000  -0.230954)
       (0.671089  0.100000  -0.240710)
       (0.687581  0.100000  -0.248588)
       (0.704769  0.100000  -0.256515)
    )
    spline 16 18
    (
       (-0.234923  0.100000  0.085505)
       (-0.234958  0.100000  0.085401)
       (-0.234989  0.100000  0.085295)
       (-0.235014  0.100000  0.085187)
       (-0.235035  0.100000  0.085077)
       (-0.235052  0.100000  0.084964)
       (-0.235066  0.100000  0.084821)
       (-0.235073  0.100000  0.084674)
       (-0.235074  0.100000  0.084524)
       (-0.235066  0.100000  0.084372)
       (-0.235047  0.100000  0.084175)
       (-0.235018  0.100000  0.083974)
       (-0.234977  0.100000  0.083769)
       (-0.234911  0.100000  0.083505)
       (-0.234829  0.100000  0.083234)
       (-0.234729  0.100000  0.082956)
       (-0.234582  0.100000  0.082598)
       (-0.234407  0.100000  0.082229)
       (-0.234154  0.100000  0.081754)
       (-0.233859  0.100000  0.081261)
       (-0.233524  0.100000  0.080752)
       (-0.232921  0.100000  0.079926)
       (-0.232220  0.100000  0.079062)
       (-0.231205  0.100000  0.077929)
       (-0.230037  0.100000  0.076742)
       (-0.227902  0.100000  0.074778)
       (-0.225385  0.100000  0.072685)
       (-0.222482  0.100000  0.070468)
       (-0.215673  0.100000  0.065787)
       (-0.207314  0.100000  0.060656)
       (-0.197355  0.100000  0.055083)
       (-0.185754  0.100000  0.049076)
       (-0.172479  0.100000  0.042644)
       (-0.157516  0.100000  0.035794)
       (-0.140870  0.100000  0.028541)
       (-0.122565  0.100000  0.020899)
       (-0.102645  0.100000  0.012888)
       (-0.081173  0.100000  0.004532)
       (-0.058231  0.100000  -0.004142)
       (-0.033917  0.100000  -0.013104)
       (-0.008340  0.100000  -0.022323)
    )
    spline 18 19
    (
       (-0.008340  0.100000  -0.022323)
       (0.018379  0.100000  -0.031763)
       (0.046112  0.100000  -0.041394)
       (0.074730  0.100000  -0.051180)
       (0.104103  0.100000  -0.061091)
       (0.134105  0.100000  -0.071095)
       (0.164618  0.100000  -0.081169)
       (0.195536  0.100000  -0.091290)
       (0.226768  0.100000  -0.101441)
       (0.258236  0.100000  -0.111609)
       (0.289885  0.100000  -0.121791)
       (0.321681  0.100000  -0.131984)
       (0.353606  0.100000  -0.142198)
       (0.385673  0.100000  -0.152445)
       (0.417908  0.100000  -0.162747)
       (0.450364  0.100000  -0.173129)
       (0.483105  0.100000  -0.183627)
       (0.516218  0.100000  -0.194278)
       (0.549793  0.100000  -0.205132)
       (0.583930  0.100000  -0.216239)
       (0.617902  0.100000  -0.227386)
       (0.645587  0.100000  -0.236558)
       (0.668087  0.100000  -0.244082)
       (0.686321  0.100000  -0.250235)
       (0.704769  0.100000  -0.256515)
    )
    arc 0 1 (-5.656854  0.000000  5.656854)
    arc 0 9 (-5.656854  0.000000  -5.656854)
    arc 12 13 (-5.656854  0.100000  5.656854)
    arc 12 21 (-5.656854  0.100000  -5.656854)
);

boundary 
( 
    inlet 
    { 
        type patch; 
        faces 
        ( 
            (13 12 0 1)
            (12 21 9 0)
        ); 
    } 

    outlet 
    { 
        type patch; 
        faces 
        ( 
            (23 20 8 11)
            (20 15 3 8)
        ); 
    } 

    topAndBottom 
    { 
        type patch; 
        faces 
        ( 
            (15 14 2 3)
            (14 13 1 2)
            (21 22 10 9)
            (22 23 11 10)
        ); 
    } 

    airfoil 
    { 
        type wall; 
        faces 
        ( 
            (17 16 4 5)
            (19 17 5 7)
            (16 18 6 4)
            (18 19 7 6)
        ); 
    } 
); 
 
mergePatchPairs 
( 
); 
 
// ************************************************************************* // 
